КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиДополнительныхРеквизитов/КонтурЛогистика_НастройкиДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп/Module.bsl
Функция ПолучитьМассивОбъектовМетаданныхСДополнительнымиРеквизитами() Экспорт
	
	МассивОбъектов = Новый Массив;
	
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		
		Если Лев(ОбъектМетаданных.Имя, 16) = "КонтурЛогистика_" Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			
			Если Реквизит.РасширениеКонфигурации() <> Неопределено
				И Реквизит.РасширениеКонфигурации().Имя = "РасширениеКонтурЛогистика_ДополнительныеРеквизиты" Тогда 
				
				МассивОбъектов.Добавить(ОбъектМетаданных);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
			
			Для каждого Реквизит Из ТЧ.Реквизиты Цикл
				
				Если Реквизит.РасширениеКонфигурации() <> Неопределено
					И Реквизит.РасширениеКонфигурации().Имя = "РасширениеКонтурЛогистика_ДополнительныеРеквизиты" Тогда 
				
					МассивОбъектов.Добавить(ОбъектМетаданных);
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		
		Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			
			Если Реквизит.РасширениеКонфигурации() <> Неопределено
				И Реквизит.РасширениеКонфигурации().Имя = "РасширениеКонтурЛогистика_ДополнительныеРеквизиты" Тогда 
				
				МассивОбъектов.Добавить(ОбъектМетаданных);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
			
			Для каждого Реквизит Из ТЧ.Реквизиты Цикл
				
				Если Реквизит.РасширениеКонфигурации() <> Неопределено
					И Реквизит.РасширениеКонфигурации().Имя = "РасширениеКонтурЛогистика_ДополнительныеРеквизиты" Тогда 
				
					МассивОбъектов.Добавить(ОбъектМетаданных);
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция ПолучитьТипЛогистикиДополнительногоРеквизита(ИмяРеквизита)  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ИмяДополнительногоРасширенияДополнительныеРеквизитыПоИмениКонфигурации(ИмяКонфигурации));
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВозможноХранениеРасширений() Тогда
		Если РасширенияКонфигурации.Получить(Отбор).Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	 	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизиты_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = ОбщийМодуль.СтруктураДополнительныхРеквизитов();
	
	Если СтруктураДополнительныхРеквизитов.Свойство(ИмяРеквизита)
		И СтруктураДополнительныхРеквизитов[ИмяРеквизита].ТипЛогистика = Истина 
		И СтруктураДополнительныхРеквизитов[ИмяРеквизита].Свойство("Тип") Тогда
		
		ТипРеквизита = СтруктураДополнительныхРеквизитов[ИмяРеквизита].Тип;
		
		Если Найти(ТипРеквизита, "КонтурЛогистика_") > 0 Тогда
			Возврат ТипРеквизита;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция РасширениеСДополнительнымиРеквизитамиУстановлено() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВозможноХранениеРасширений() Тогда
		Возврат РасширенияКонфигурации.Получить(Новый Структура("Имя", "РасширениеКонтурЛогистика_ДополнительныеРеквизиты")).Количество() = 1;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНастройкуДопРеквизита(ИмяРеквизита, Объект) Экспорт
	Возврат Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.НайтиНастройку(ИмяРеквизита, Объект);	
КонецФункции
